package com.example.suratha_converter;

public class BaminiToUni {
	
	
	public static String ConvertBamini(String TextData) {
    	
	   	
    	String Show = "n"+"\\"+"s";
    	String ShO = "N"+"\\"+"h";
    	String Sho = "n"+"\\"+"h";
    	String ShA = "\\"+"h";
    	String Shi = "\\"+"p";
    	String ShI = "\\"+"P";
    	String She = "n"+"\\";
    	String ShE = "N"+"\\";
    	String Shai = "i"+"\\";
    	String Sh = "\\"+";";
    	String Sha = "\\";
    	
    	String ShaText[] = {Show,  ShO,  Sho,  ShA,  Shi,  ShI, She,  ShE,  Shai,  Sh,  Sha};

		String ShaReplace[] = {"ஷௌ",  "ஷோ",  "ஷொ",  "ஷா",  "ஷி",  "ஷீ", "ஷெ",  "ஷே", "ஷை",  "ஷ்",  "ஷ"};
		
    	
    	String TamilText[] = { "sp", "hp",  "hP",  "uP",  "u;",  "h;",  "H",  "nfs",  "Nfh",  "nfh",  
    			"fh",  "fp", "fP",  "F",  "\\$",  "nf",  "Nf",  "if",  "f;",  "f",  
    			"nqs",  "Nqh",  "nqh",  "qh",  "qp",  "qP", "nq",  "Nq",  "iq",  "q;", 
    			
    			"q",  "nrs",  "Nrh",  "nrh",  "rh",  "rp",  "rP",  "R",  "#",  "nr",  
    			"Nr",  "ir",  "r;",  "r",  "n\\[s",  "N\\[h",  "n\\[h",  "\\[h",  "\\[p",  "\\[P",  
    			"\\[\\{",  "\\[\\_",  "n\\[",  "N\\[",  "i\\[",  "\\[;",  "\\[",  "nQs",  "NQh",  "nQh",
    			
    			"Qh",  "Qp",  "QP",  "nQ",  "NQ",  "iQ", "Q;",  "Q",  "nls",  "Nlh",  
    			"nlh",  "lp",  "lP",  "lh",  "b",  "B",  "L",  "\\^",  "nl",  "Nl",  
    			"il",  "l;",  "l",  "nzs",  "Nzh",  "nzh",  "zh",  "zp",  "zP",  "Zh",
    			
    			"Z\\}",  "nz",  "Nz",  "iz",  "z;",  "Z",  "z",  "njs",  "Njh",  "njh",  
    			"jh",  "jp",  "jP",  "Jh",  "Jh",  "J\\}",  "J",  "nj",  "Nj",  "ij",  
    			"j;",  "j",  "nes",  "Neh",  "neh",  "eh",  "ep",  "eP",  "E\\}",  "Eh",
    			
    			"E",  "ne",  "Ne",  "ie",  "e;",  "e",  "nds",  "Ndh",  "ndh",  "dh",  
    			"dp",  "dP",  "D\\}",  "Dh",  "D",  "nd",  "Nd",  "id",  "d;",  "d",  
    			"ngs",  "Ngh",  "ngh",  "gh",  "gp",  "gP",  "G",  "ng",  "Ng",  "ig",
    			
    			"g;",  "g",  "nks",  "Nkh",  "nkh",  "kh",  "kp",  "kP",  "K",  "\\%",  
    			"nk",  "Nk",  "ik",  "k;",  "k",  "nas",  "Nah",  "nah",  "ah",  "ap",  
    			"aP",  "A",  "A\\+",  "na",  "Na",  "ia",  "a;",  "a", "nus",  "Nuh",
    			
    			"nuh",  "uh",  "up",  "U",  "\\&",  "nu",  "Nu",  "iu",  "u",  "nys",  
    			"Nyh",  "nyh",  "yh",  "yp",  "yP",  "Yh",  "Y\\}",  "Y",  "ny",  "Ny",  
    			"iy",  "y;",  "y",  "nss",  "Nsh",  "nsh", "sh",  "sP",  "Sh",  "S",
    			
    			"ns",  "Ns",  "is",  "s;",  "s",  "nts",  "Nth",  "nth",  "th",  "tp",  
    			"tP",  "nt",  "Nt",  "it",  "t;",  "t",  "noo",  "Noh",  "noh",  "oh", 
    			"op",  "oP",  "\\*",  "O",  "no",  "No",  "io",  "o;",  "o",  "nws",
    			
    			"Nwh",  "nwh",  "wh",  "wp",  "wP",  "Wh",  "W\\}",  "W", "nw",  "Nw",  
    			"iw",  "w;",  "w",  "n\\`\\`",  "N\\`h",  "n\\`h",  "\\`h",  "\\`p",  "\\`P",  "n\\`",  
    			"N\\`",  "i\\`",  "\\`;",  "\\`", "n\\]s",  "N\\]h",  "n\\]h",  "\\]h",  "\\]p",  
    			"\\]P",  "n\\]",  "N\\]",  "i\\]",  "\\];",  "\\]",  "\\>",  "m",  "M",  "\\<",  
    			"c",  "C",  "v",  "V",  "I",  "x",  "X",  "xs",  "\\/", "\\,",
    			
    			"//=",  "\\>",  "T",  "//ä//ä",  "வு\\+",  "பு\\+", 	"யு\\+",  "சு\\+"};

		String TamilReplace[] = {"ளி",  "ரி",  "ரீ",  "ரீ",  "ர்",  "ர்",  "ர்",  "கௌ",  "கோ",  "கொ",  
				"கா",  "கி",  "கீ",  "கு",  "கூ",  "கெ",  "கே",  "கை",  "க்", "க",  
				"ஙௌ",  "ஙோ",  "ஙொ",  "ஙா",  "ஙி",  "ஙீ",  "ஙெ",  "ஙே",  "ஙை",  "ங்",
				
				"ங",  "சௌ",  "சோ",  "சொ",  "சா",  "சி",  "சீ",  "சு",  "சூ", "செ",  
				"சே",  "சை",  "ச்",  "ச",  "ஜௌ",  "ஜோ",  "ஜொ",  "ஜா",  "ஜி",  "ஜீ",  
				"ஜு",  "ஜூ",  "ஜெ",  "ஜே",  "ஜை",  "ஜ்",  "ஜ",  "ஞௌ",  "ஞோ",	"ஞொ",
				
				"ஞா",  "ஞி",  "ஞீ",  "ஞெ",  "ஞே",  "ஞை",  "ஞ்",  "ஞ", "டௌ", 	"டோ",  
				"டொ",  "டி",  "டீ",  "டா",  "டி",  "டீ",  "டு",  "டூ",  "டெ", "டே",  
				"டை",  "ட்",  "ட",  "ணௌ",  "ணோ",  "ணொ",  "ணா",  "ணி", "ணீ", "ணூ",  
				
				"ணூ",  "ணெ",  "ணே",  "ணை",  "ண்",  "ணு",  "ண", "தௌ", "தோ",  "தொ",  
				"தா",  "தி",  "தீ",  "தூ",  "தூ",  "தூ",  "து",  "தெ", 	"தே",  "தை",  
				"த்",  "த",  "நௌ",  "நோ",  "நொ",  "நா",  "நி", "நீ", "நூ",  "நூ",  
				
				"நு",  "நெ",  "நே",  "நை",  "ந்",  "ந",  "னௌ",  "னோ", "னொ",  "னா",  
				"னி",  "னீ",  "னூ",  "னூ",  "னு",  "னெ",  "னே",  "னை", "ன்",  "ன",  
				"பௌ",  "போ",  "பொ",  "பா",  "பி",  "பீ",  "பு",  "பெ",  "பே",  "பை",  
				
				"ப்",  "ப",  "மௌ",  "மோ",  "மொ",  "மா",  "மி", "மீ",  "மு",  "மூ",  
				"மெ",  "மே",  "மை",  "ம்",  "ம",  "யௌ",  "யோ",  "யொ", 	"யா",  "யி", 
				"யீ",  "யு",  "யூ",  "யெ",  "யே",  "யை",  "ய்", "ய", "ரௌ",  "ரோ",  
				
				"ரொ",  "ரா",  "ரி",  "ரு",  "ரூ",  "ரெ",  "ரே",  "ரை", "ர",  "லௌ",  
				"லோ",  "லொ",  "லா",  "லி",  "லீ",  "லூ",  "லூ", "லு", "லெ",  "லே",  
				"லை",  "ல்",  "ல",  "ளௌ",  "ளோ",  "ளொ",  "ளா",  "ளீ",  "ளூ",  	"ளு",  
				
				"ளெ",  "ளே",  "ளை",  "ள்",  "ள",  "வௌ", "வோ",  "வொ",  "வா",  "வி",  
				"வீ",  "வெ",  "வே",  "வை",  "வ்",  "வ",  "ழௌ",  "ழோ",  "ழொ",  "ழா",  
				"ழி",  "ழீ",  "ழூ",  "ழு",  "ழெ", "ழே",  "ழை",  "ழ்", "ழ",  "றௌ",  
				
				"றோ",  "றொ",  "றா",  "றி",  "றீ",  "றூ",  "றூ",  "று",  "றெ",  "றே",  
				"றை",  "ற்",  "ற",  "ஹௌ",  "ஹோ",  "ஹொ",  "ஹா",  "ஹி", "ஹீ",  "ஹெ",  
				"ஹே",  "ஹை",  "ஹ்",  "ஹ",  "ஸௌ",  "ஸோ",  "ஸொ",	"ஸா",  "ஸி",  
				"ஸீ",  "ஸெ",  "ஸே",  "ஸை",  "ஸ்",  "ஸ",  "ää", "அ", "ஆ",  "ஈ",  
				"உ",  "ஊ",  "எ",  "ஏ",  "ஐ",  "ஒ", "ஓ",  "ஔ", "ஃ",  "இ",
				
				"ஸ்ரீ", ",", "வு",  ",",  "வூ",  "பூ",  "யூ",  "சூ" };


		String ResultShaText = TextData.replace(ShaText[0], ShaReplace[0]);

		int Shacount = 0;

		while (Shacount < ShaText.length) {

			ResultShaText = ResultShaText.replace(ShaText[Shacount],
					ShaReplace[Shacount]);

			Shacount++;
		}

		

		String ResultText = ResultShaText.replaceAll(TamilText[0], TamilReplace[0]);

		int count = 0;

		while (count < TamilText.length) {

			ResultText = ResultText.replaceAll(TamilText[count],
					TamilReplace[count]);

			count++;
		}

		return ResultText;
    	
    }

}
