package com.example.suratha_converter;

public class TsciiToUni {
	
	
	public static String ConvertTscii(String TextData) {
		
	   	
		/*
		String Show = "n"+"\\"+"s";
		String ShO = "N"+"\\"+"h";
		String Sho = "n"+"\\"+"h";
		String ShA = "\\"+"h";
		String Shi = "\\"+"p";
		String ShI = "\\"+"P";
		String She = "n"+"\\";
		String ShE = "N"+"\\";
		String Shai = "i"+"\\";
		String Sh = "\\"+";";
		String Sha = "\\";
		
		String ShaText[] = {Show,  ShO,  Sho,  ShA,  Shi,  ShI, She,  ShE,  Shai,  Sh,  Sha};

		String ShaReplace[] = {"ஷௌ",  "ஷோ",  "ஷொ",  "ஷா",  "ஷி",  "ஷீ", "ஷெ",  "ஷே", "ஷை",  "ஷ்",  "ஷ"};
		
		*/
		
		String TamilText[] = { "­", "þ", "‡", "‡¡", "‡¢", "‡£", "‡¤", "‡¥", "¦‡", "§‡",
				"¨‡", "¦‡¡", "§‡¡", "¦‡Ç", "Œ", "¦¸ª", "§¸¡", "¦¸¡", "¸¡", "¸¢",
				"¸£", "Ì", "Ü", "¦¸", "§¸", "¨¸", "¦¸¡", "ì", "¸", "¦¹ª",
				"§¹¡", "¦¹¡", "¹¡", "¹¢", "¹£", "™", "›", "¦¹", "§¹", "¨¹",
				"¦¹¡", "í", "¹", "¦ºª", "§º¡", "¦º¡", "º¡", "º¢", "º£", "Í",
				"Ý", "¦º", "§º", "¨º", "¦º¡", "î", "º", "¦ƒª", "§ƒ¡", "¦ƒ¡",
				"ƒ¡", "ƒ¢", "ƒ£", "ƒ¤", "ƒ¥", "¦ƒ", "§ƒ", "¨ƒ", "¦ƒ¡", "ˆ",
				"ƒ", "¦»ª", "§»¡", "¦»¡", "»¡", "»¢", "»£", "", "œ", "¦»",
				"§»", "¨»", "¦»¡", "ï", "»", "¦¼ª", "§¼¡", "¦¼¡", "¼¡", "Ê",
				"Ë", "Î", "Þ", "¦¼", "§¼", "¨¼", "¦¼¡", "ð", "¼", "¦½ª",
				"§½¡", "¦½¡", "½¡", "½¢", "½£", "Ï", "ß", "¦½", "§½", "¨½",
				"¦½¡", "ñ", "½", "¦¾ª", "§¾¡", "¦¾¡", "¾¡", "¾¢", "¾£", "Ð",
				"à", "¦¾", "§¾", "¨¾", "¦¾¡", "ò", "¾", "¦¿ª", "§¿¡", "¦¿¡",
				"¿¡", "¿¢", "¿£", "Ñ", "á", "¦¿", "§¿", "¨¿", "¦¿¡", "ó",
				"¿", "¦Éª", "§É¡", "¦É¡", "É¡", "É¢", "É£", "Û", "ë", "¦É",
				"§É", "¨É", "¦É¡", "ý", "É", "¦Àª", "§À¡", "¦À¡", "À¡", "À¢",
				"À£", "Ò", "â", "¦À", "§À", "¨À", "¦À¡", "ô", "À", "¦Áª",
				"§Á¡", "¦Á¡", "Á¡", "Á¢", "Á£", "Ó", "ã", "¦Á", "§Á", "¨Á",
				"¦Á¡", "õ", "Á", "¦Âª", "§Â¡", "¦Â¡", "Â¡", "Â¢", "Â£", "Ô",
				"ä", "¦Â", "§Â", "¨Â", "ö", "Â", "¦Ãª", "§Ã¡", "¦Ã¡", "Ã¡",
				"Ã¢", "Ã£", "Õ", "å", "¦Ã", "§Ã", "¨Ã", "÷", "Ã", "¦Äª",
				"§Ä¡", "¦Ä¡", "Ä¡", "Ä¢", "Ä£", "Ö", "æ", "¦Ä", "§Ä", "¨Ä",
				"¦Ä¡", "ø", "Ä", "¦Çª", "§Ç¡", "¦Ç¡", "Ç¡", "Ç¢", "Ç£", "Ù",
				"é", "¦Ç", "§Ç", "¨Ç", "û", "Ç", "¦Åª", "§Å¡", "¦Å¡", "Å¡",
				"Å¢", "Å£", "×", "ç", "¦Å", "§Å", "¨Å", "¦Å¡", "ù", "Å",
				"¦Æª", "§Æ¡", "¦Æ¡", "Æ¡", "Æ¢", "Æ£", "Ø", "è", "¦Æ", "§Æ",
				"¨Æ", "¦Æ¡", "ú", "Æ", "¦Èª", "§È¡", "¦È¡", "È¡", "È¢", "È£",
				"Ú", "ê", "¦È", "§È", "¨È", "¦È¡", "ü", "È", "¦†ª", "§†¡",
				"¦†¡", "†¡", "†¢", "†£", "¦†", "§†", "¨†", "¦†¡", "‹", "†",
				"¦„ª", "§„¡", "¦„¡", "„¡", "„¢", "„£", "¦„", "§„", "¨„", "¦„¡",
				"‰", "„", "¦…ª", "§…¡", "¦…¡", "…¡", "…¢", "…£", "¦…", "§…",
				"¨…", "¦…¡", "Š", "…", "«", "¬", "®", "¯", "°", "±",
				"²", "³", "´", "µ", "¶", "∙", "", "", "", "",
				"", "", "", "Ÿ", "", "", "", "", "‚"};

		String TamilReplace[] = {"இ", "இ", "க்ஷ", "க்ஷா", "க்ஷி", "க்ஷீ", "க்ஷு", "க்ஷூ", "க்ஷெ", "க்ஷே",
				"க்ஷை", "க்ஷொ", "க்ஷோ", "க்ஷௌ", "க்ஷ்", "கௌ", "கோ", "கொ", "கா", "கி",
				"கீ", "கு", "கூ", "கெ", "கே", "கை", "கொ", "க்", "க", "ஙௌ",
				"ஙோ", "ஙொ", "ஙா", "ஙி", "ஙீ", "ஙு", "ஙூ", "ஙெ", "ஙே", "ஙை",
				"ஙொ", "ங்", "ங", "சௌ", "சோ", "சொ", "சா", "சி", "சீ", "சு",
				"சூ", "செ", "சே", "சை", "சொ", "ச்", "ச", "ஜௌ", "ஜோ", "ஜொ",
				"ஜா", "ஜி", "ஜீ", "ஜு", "ஜூ", "ஜெ", "ஜே", "ஜை", "ஜொ", "ஜ்",
				"ஜ", "ஞௌ", "ஞோ", "ஞொ", "ஞா", "ஞி", "ஞீ", "ஞு", "ஞூ", "ஞெ",
				"ஞே", "ஞை", "ஞொ", "ஞ்", "ஞ", "டௌ", "டோ", "டொ", "டா", "டி",
				"டீ", "டு", "டூ", "டெ", "டே", "டை", "டொ", "ட்", "ட", "ணௌ",
				"ணோ", "ணொ", "ணா", "ணி", "ணீ", "ணு", "ணூ", "ணெ", "ணே", "ணை",
				"ணொ", "ண்", "ண", "தௌ", "தோ", "தொ", "தா", "தி", "தீ", "து",
				"தூ", "தெ", "தே", "தை", "தொ", "த்", "த", "நௌ", "நோ", "நொ",
				"நா", "நி", "நீ", "நு", "நூ", "நெ", "நே", "நை", "நொ", "ந்",
				"ந", "னௌ", "னோ", "னொ", "னா", "னி", "னீ", "னு", "னூ", "னெ",
				"னே", "னை", "னொ", "ன்", "ன", "பௌ", "போ", "பொ", "பா", "பி",
				"பீ", "பு", "பூ", "பெ", "பே", "பை", "பொ", "ப்", "ப", "மௌ",
				"மோ", "மொ", "மா", "மி", "மீ", "மு", "மூ", "மெ", "மே", "மை",
				"மொ", "ம்", "ம", "யௌ", "யோ", "யொ", "யா", "யி", "யீ", "யு",
				"யூ", "யெ", "யே", "யை", "ய்", "ய", "ரௌ", "ரோ", "ரொ", "ரா",
				"ரி", "ரீ", "ரு", "ரூ", "ரெ", "ரே", "ரை", "ர்", "ர", "லௌ",
				"லோ", "லொ", "லா", "லி", "லீ", "லு", "லூ", "லெ", "லே", "லை",
				"லொ", "ல்", "ல", "ளௌ", "ளோ", "ளொ", "ளா", "ளி", "ளீ", "ளு",
				"ளூ", "ளெ", "ளே", "ளை", "ள்", "ள", "வௌ", "வோ", "வொ", "வா",
				"வி", "வீ", "வு", "வூ", "வெ", "வே", "வை", "வொ", "வ்", "வ",
				"ழௌ", "ழோ", "ழொ", "ழா", "ழி", "ழீ", "ழு", "ழூ", "ழெ", "ழே",
				"ழை", "ழொ", "ழ்", "ழ", "றௌ", "றோ", "றொ", "றா", "றி", "றீ",
				"று", "றூ", "றெ", "றே", "றை", "றொ", "ற்", "ற", "ஹௌ", "ஹோ",
				"ஹொ", "ஹா", "ஹி", "ஹீ", "ஹெ", "ஹே", "ஹை", "ஹொ", "ஹ்", "ஹ",
				"ஷௌ", "ஷோ", "ஷொ", "ஷா", "ஷி", "ஷீ", "ஷெ", "ஷே", "ஷை", "ஷொ",
				"ஷ்", "ஷ", "ஸௌ", "ஸோ", "ஸொ", "ஸா", "ஸி", "ஸீ", "ஸெ", "ஸே",
				"ஸை", "ஸொ", "ஸ்", "ஸ", "அ", "ஆ", "ஈ", "உ", "ஊ", "எ",
				"ஏ", "ஐ", "ஒ", "ஓ", "ஔ", "ஃ", "௧", "௨", "௩", "௪",
				"௫", "௰", "௱", "௲", "௯", "௭", "௮", "௬", "ஸ்ரீ" };



		String ResultText = TextData.replaceAll(TamilText[0], TamilReplace[0]);

		int count = 0;

		while (count < TamilText.length) {

			ResultText = ResultText.replaceAll(TamilText[count],
					TamilReplace[count]);

			count++;
		}

		return ResultText;
		
	}
		
}
